_posts/technology/2024-01-30-cppcoreguidelines-nl16.html
---
layout: post
title: CppCoreGuidelines NL.16 遵循常规的类成员声明顺序
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Use a conventional class member declaration order&rdquo;
</p>

<p>
理由
</p>

<p>
常规的类成员顺序提升可读性。
</p>


<p>
声明类成员的时候，遵循以下顺序：
</p>
<ul class="org-ul">
<li>类型：类类型、枚举类型、别名（using）</li>
<li>构造函数、赋值函数、析构函数</li>
<li>成员函数</li>
<li>成员数据</li>
</ul>

<p>
先 <code>public</code>  再 <code>protected</code>  最后 <code>private</code>
</p>

<p>
如果没有其他更好的想法的话，请遵循这条规则。这条规则是很多人要求添加的。
</p>


<p>
例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">X</span> <span style="color: #707183;">{</span>
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #3F7F5F;">// interface</span>
<span style="color: #7F0055; font-weight: bold;">protected</span>:
    <span style="color: #3F7F5F;">// unchecked function for use by derived class implementations</span>
<span style="color: #7F0055; font-weight: bold;">private</span>:
    <span style="color: #3F7F5F;">// implementation details</span>
<span style="color: #707183;">}</span>;
</pre>
</div>


<p>
例子
</p>

<p>
有时候，默认的声明顺序违反了公开接口和实现细节分开的想法，这个时候，私有类型和函数定义可以放在 <code>private</code> 下。
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">X</span> <span style="color: #707183;">{</span>
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #3F7F5F;">// interface</span>
<span style="color: #7F0055; font-weight: bold;">protected</span>:
    <span style="color: #3F7F5F;">// unchecked function for use by derived class implementations</span>
<span style="color: #7F0055; font-weight: bold;">private</span>:
    <span style="color: #3F7F5F;">// implementation details (types, functions, and data)</span>
<span style="color: #707183;">}</span>;
</pre>
</div>


<p>
坏例子
</p>

<p>
不要连续放多个一样的访问设定，如 <code>public</code> 。或者交替使用不同的访问设定。
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">X</span> <span style="color: #707183;">{</span>   <span style="color: #3F7F5F;">// bad</span>
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold; font-style: italic;">f</span><span style="color: #7388d6;">()</span>;
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #0000ff; font-weight: bold; font-style: italic;">g</span><span style="color: #7388d6;">()</span>;
    <span style="color: #3F7F5F;">// ...</span>
<span style="color: #707183;">}</span>;
</pre>
</div>

<p>
用宏定义声明一组成员往往会违反此规则。其实宏定义还混淆了我们所要表达的程序意图。
</p>


<p>
强化
</p>

<p>
标记违反本规则建议的顺序的情况。可能会有很多老的代码违反了此规则。
</p>
